"STORE_DESCRIPTION" = "VLC je voľne dostupný multi-platformový prehrávač multimédií, ktorá má otvorený zdrojový kód.\nPriamo a bez konverzie dokáže prehrávať všetky vaše filmy, show a hudbu vo väčšine formátov.\nUmožňuje synchronizáciu súborov so službami Dropbox, GDrive, OneDrive, Box, iCloud Drive, iTunes, priame stiahnutia a zdieľanie cez Wi-Fi, ako aj streamovanie z mediálnych serverov SMB, FTP, SFTP, NFS, UPnP/DLNA a webu.\nVLC ponúka aj podporu pokročilých titulkov, vrátane úplnej kompatibility s SSA, zvukom s viacerými stopami, ovládaním rýchlosti prehrávania a vykresľovaním cez Chromecast.\n\nVLC je úplne zadarmo a má otvorený zdrojový kód.";

"STORE_DESCRIPTION_TV" = "VLC je voľne dostupný, multiplatformový prehrávač médií.\nPriamo a bez konvertovania dokáže prehrať všetky vaše filmy, show a hudbu vo väčšine formátov - priamo a bez konvertovania.\nUmožňuje vzdialené prehrávanie z vášho zariadenia Mac alebo PC, cez Web UI, ako aj streamovanie z mediálnych serverov SMB, FTP, SFTP, NFS, UPnP/DLNA a webu.\nVLC ponúka podporu pre pokročilé titulky, vrátane úplnej kompatibility s SSA, zvukom s viacerými stopami a s ovládaním rýchlosti prehrávania.\nVLC je úplne zadarmo a má otvorený zdrojový kód.\nObaly (artwork) poskytuje TMDb, čo je databáza filmov spravovaná komunitou.";

"UNKNOWN_TRACK_TYPE" = "Neznámy typ stopy";
"CHOOSE_TITLE" = "Vybrať titul";
"CHOOSE_CHAPTER" = "Vybrať kapitolu";
"CHAPTER_SELECTION_TITLE" = "Kapitoly";
"TITLE" = "Titul";
"CHAPTER" = "Kapitola";
"TRACK_SELECTION" = "Výber stopy";
"AUDIO" = "Zvuk";
"SUBTITLES" = "Titulky";
"LANGUAGE" = "Jazyk";
"MEDIA_INFO" = "Informácia o médiu";
"VIDEO_DIMENSIONS" = "Rozmery videa";
"FORMAT_VIDEO_DIMENSIONS" = "%ix%i pixelov";
"FORMAT_AUDIO_TRACKS" = "%i zvukových stôp";
"ONE_AUDIO_TRACK" = "Jedna zvuková stopa";
"FORMAT_SPU_TRACKS" = "%i stôp s titulkami";
"ONE_SPU_TRACK" = "Jedna stopa s titulkami";
"TRACKS" = "Stopy: %i";
"TRACK" = "Stopa: %i";
"TRACKS_DURATION" = "%u stôp, trvanie: %@";
"NB_ALBUM_FORMAT" = "%i album";
"NB_ALBUMS_FORMAT" = "%i albumy";

"PLAYING_EXTERNALLY_TITLE" = "Pripojená TV";
"PLAYING_EXTERNALLY_DESC" = "Toto video sa prehráva na TV";
"PLAYING_EXTERNALLY_ADDITION" = "Práve sa prehráva na:"; /* \n should stay in every translation */

"VFILTER_HUE" = "Farebný odtieň";
"VFILTER_CONTRAST" = "Kontrast";
"VFILTER_BRIGHTNESS" = "Jas";
"VFILTER_SATURATION" = "Sýtosť";
"VFILTER_GAMMA" = "Gamma";

"PRESET_PREAMP_SETTING" = "Prednastavenia/nastavenia predzosilnenia";
"PREAMP" = "Predzosilnenie";
"SNAP_BANDS" = "Prichytiť pásma";

"PLAYBACK_FAILED" = "Prehrávanie zlyhalo";
"PLEASE_WAIT" = "Prosím čakajte";
"AR_CHANGED" = "Stranový pomer: %@";
"DEFAULT" = "Predvolený";
"FILL_TO_SCREEN" = "Orezať pre vyplnenie obrazovky";
"PLAYBACK_SPEED" = "Rýchlosť prehrávania";
"SPU_DELAY" = "Oneskorenie titulkov";
"AUDIO_DELAY" = "Oneskorenie zvuku";
"BUTTON_SLEEP_TIMER" = "Časovač uspania";
"SLEEP_TIMER_UPDATED" = "Časovač uspania aktualizovaný";
"CONTINUE_PLAYBACK" = "Pokračovať v prehrávaní?";
"CONTINUE_PLAYBACK_LONG" = "Chcete opäť spustiť prehrávanie \"%@\" tam, kde ste skončili?";

"BUTTON_ABOUT" = "O aplikácii";
"BUTTON_BACK" = "Späť";
"BUTTON_DONE" = "Hotovo";
"BUTTON_CANCEL" = "Storno";
"BUTTON_SAVE" = "Uložiť";
"BUTTON_DOWNLOAD" = "Stiahnuť";
"BUTTON_DELETE" = "Vymazať";
"BUTTON_OK" = "OK";
"BUTTON_DISMISS" = "Zrušiť";
"BUTTON_CONTACT" = "Kontaktujte nás";
"BUTTON_CONNECT" = "Pripojiť";
"BUTTON_RENAME" = "Premenovať";
"BUTTON_LEARN_MORE" = "Viac informácií";
"BUTTON_LOGOUT" = "Odhlásiť";
"BUTTON_CONTINUE" = "Pokračovať";
"BUTTON_SET" = "Nastaviť";
"BUTTON_RESET" = "Reset";
"BUTTON_RESCAN" = "Preskenovať znovu";
"PRIVATE_PLAYBACK_TOGGLE" = "Súkromné prehrávanie";
"SCAN_SUBTITLE_TOGGLE" = "Skenovať na titulky (len cez http)";

"BUTTON_RENDERER" = "Zariadenia na streamovanie (casting)";
"BUTTON_RENDERER_HINT" = "Zobraziť menu pre dostupné zariadeni na streamovanie (casting)";
"BUTTON_AIRPLAY" = "AirPlay alebo Bluetooth";
"BUTTON_AIRPLAY_HINT" = "Zobraziť menu dostupných zariadení AirPlay alebo Bluetooth";

"UPGRADING_LIBRARY" = "Aktualizovanie knižnice médii";

"FAVORITES" = "Obľúbené položky";
"NO_FAVORITES" = "Nie sú dostupné žiadne obľúbené položky";
"NO_FAVORITES_DESCRIPTION" = "Označte svoje obľúbené priečinky počas prehliadania serverov a tie sa zobrazia v tomto zozname.";
"ADD_FAVORITE" = "Pridať do obľúbených";
"REMOVE_FAVORITE" = "Odstrániť z obľúbených";
"FAVORITE_ALERT_TITLE" = "Chcete pridať tento priečinok do obľúbených?";
"UNFAVORITE_ALERT_TITLE" = "Chcete odstrániť tento priečinok z obľúbených?";

"OPEN_NETWORK" = "Otvoriť sieťový stream";
"NETWORK_TITLE" = "Sieťový stream";
"OPEN_NETWORK_HELP" = "Pre priame otvorenie streamu zadajte HTTP, RTSP, RTMP, MMS, FTP or UDP/RTP adresu.";
"HTTP_UPLOAD_SERVER_OFF" = "Neaktívny server";
"HTTP_UPLOAD_NO_CONNECTIVITY" = "Žiadne aktívne Wi-Fi pripojenie";
"OPEN_STREAM_OR_DOWNLOAD" = "Chcete súbor z tejto adresy URL stiahnuť alebo prehrať?";
"ALWAYS_STREAM_URL" = "Vždy prehrávať adresy URL";
"SHARED_VLC_IOS_LIBRARY" = "Zdieľaná knižnica VLC for iOS";
"SMB_CIFS_FILE_SERVERS" = "Súborové servery (SMB)";

"MANAGED_SERVERS" = "Spravované";

"SMB_CIFS_FILE_SERVERS_SHORT" = "SMB";

"HTTP_DOWNLOAD_CANCELLED" = "Sťahovanie bolo ukončené používateľom";

"DOWNLOAD_FROM_HTTP" = "Sťahovanie";
"ERROR_NUMBER" = "Nastala chyba %i";
"DOWNLOAD_FAILED" = "Sťahovanie nebolo úspešné";
"FILE_NOT_SUPPORTED" = "Formát súboru nie je podporovaný";
"FILE_NOT_SUPPORTED_LONG" = "Formát súboru používaný %@ nie je podporovaný touto verziou programu VLC for iOS.";
"SCHEME_NOT_SUPPORTED" = "Schéma adresy nie je podporovaná";
"SCHEME_NOT_SUPPORTED_LONG" = "Schéma adresy (%@) nie je podporovaná. Prosím použite adresu začinajúcu na HTTP, HTTPS alebo FTP.";
"RENAME_MEDIA_TO" = "Zadajte nový názov pre %@";

"FOLDER_EMPTY" = "Prázdny priečinok";

"SHARING_ACTION_SHEET_TITLE_CHOOSE_FILE" = "Vyberte si súbor, ktorý chcete otvoriť:";
"SHARING_ACTIVITY_OPEN_IN_TITLE" = "Otvoriť v...";
"SHARING_ERROR_NO_FILES" = "Nenašli sa žiadne súbory na zdieľanie";
"SHARING_ERROR_NO_APPLICATIONS" = "Nepodarilo sa nájsť aplikáciu na otváranie tohto typu súboru";
"SHARING_SUCCESS_CAMERA_ROLL" = "Súbor bol úspešne uložený do Camera Roll";

"FAVORITEVC_DETAILTEXT" = "Pozrieť si svoje obľúbené priečinky";
"STREAMVC_DETAILTEXT" = "Prehrávať streamy priamo bez sťahovania";
"DOWNLOADVC_DETAILTEXT" = "Sťahovať súbory priamo do vášho zariadenia";
"HEADER_TITLE_RENDERER" = "Vybrať zariadenie na streamovanie (casting)";

"BROWSE" = "Prehľadávať";
"NETWORK" = "Sieť";
"LOCAL_NETWORK" = "Lokálna sieť";
"CONNECT_TO_SERVER" = "Pripojiť k serveru";
"FILE_SERVER" = "Súborové servery";
"USER_LABEL" = "Používateľ";
"PASSWORD_LABEL" = "Heslo";
"DISABLE_LABEL" = "Zablokovať";
"BUTTON_ANONYMOUS_LOGIN" = "Anonymné prihlásenie";

"LOCAL_SERVER_REFRESH" = "Obnoviť";
"LOCAL_SERVER_LAST_UPDATE" = "Naposledy aktualizované dňa %@";
"LOCAL_SERVER_CONNECTION_FAILED_TITLE" = "NEPODARILO SA PRIPOJIŤ K SERVERU";
"LOCAL_SERVER_CONNECTION_FAILED_MESSAGE" = "Prosím skontrolujte adresu servera a poverenia";

"FILES_APP_CELL_TITLE" = "Lokálne súbory";
"FILES_APP_CELL_SUBTITLE" = "Otvoriť súbor bez skopírovania do VLC";

"CLOUD_SERVICES" = "Cloudové služby";
"LOGIN" = "Prihlásiť";
"LOGGED_IN" = "Prihlásený";
"LOGGED_IN_SERVICES" = "%dprihlásených v službách";
"LOGGED_IN_SERVICE" = "1 prihlásený v službe";

"DROPBOX_DOWNLOAD" = "Stiahnuť súbor?";
"DROPBOX_DL_LONG" = "Chcete stiahnuť súbor \"%@\" do vášho %@?";
"DROPBOX_LOGIN" = "Prihlasovacie meno";

"GDRIVE_ERROR_FETCHING_FILES" = "Chyba počas získavania súborov";
"GDRIVE_DOWNLOAD_SUCCESSFUL" = "Váš súbor bol úspešne stiahnutý";
"GDRIVE_DOWNLOAD_SUCCESSFUL_TITLE" = "ÚSPEŠNÉ";
"GDRIVE_ERROR_DOWNLOADING_FILE" = "Počas sťahovania nastala chyba";
"GDRIVE_ERROR_DOWNLOADING_FILE_TITLE" = "CHYBA";

"ONEDRIVE_MEDIA_WITHOUT_URL" = "Vybrané médium neobsahuje adresu URL s možnosťou prehrávania";

"DISK_FULL" = "Bol dosiahnutý limit uloženia";
"DISK_FULL_FORMAT" = "%@ nie je možné uložiť do vášho %@, kvôli nedostatku voľného miesta.";

"NUM_OF_FILES" = "%i súborov";
"ONE_FILE" = "1 súbor";
"NO_FILES" = "Žiadne podporované súbory";
"DOWNLOADING" = "Prebieha sťahovanie...";
"REMAINING_TIME" = "Zostávajúci čas: %@";
"BIOMETRIC_UNLOCK" = "Odomknúť knižnicu médií\nZrušiť pre zadanie hesla";

// Passcode Strings that we need to localize for them
"Set Passcode" = "Nastaviť heslo";
"Enter Passcode" = "Zadanie hesla";
"Enter a passcode" = "Zadajte heslo";
"Enter your passcode" = "Zadajte svoje heslo";
"Passcodes did not match. Try again." = "Heslá sa nezhodujú. Skúste to ešte raz.";
"Re-enter your passcode" = "Znovu zadajte svoje heslo";
"Passcode Options" = "Vlastnosti hesla";
"4-Digit Numeric Code" = "4-číslicový numerický kód"; /* Passcode 4 digit numeric code */
"6-Digit Numeric Code" = "6-číslicový numerický kód"; /* Passcode 6 digit numeric code */

"Settings" = "Nastavenia"; // plain text key to keep compatibility with InAppSettingsKit's upstream
"ON" = "Zap.";
"OFF" = "Vyp.";

"EMPTY_LIBRARY" = "Prázdna knižnica médií";
"EMPTY_LIBRARY_LONG" = "Pre prehrávanie môžete streamovať médium zo servera na vašej lokálnej sieti, z cloudu alebo synchronizovať médium do vášho zariadenia pomocou iTunes, odoslania cez Wi-fi alebo cloudových služieb.";

"EMPTY_NO_PLAYLISTS" = "Playlisty";
"EMPTY_NO_PLAYLISTS_DESCRIPTION" = "Na vytvorenie playlistov vstúpte do režimu pre úpravy na kartách s video- alebo audio-obsahom a vyberte si obľúbené médium.\nTaktiež môžete synchronizovať existujúce playlisty z iných vašich zariadení alebo z internetu.";

"EMPTY_PLAYLIST" = "Vyprázdniť playlist";
"EMPTY_PLAYLIST_DESCRIPTION" = "Pridať médium počas úpravy v príslušných kategóriách.";

"EMPTY_HISTORY" = "Vyprázdniť históriu";
"EMPTY_HISTORY_DESCRIPTION" = "Zatiaľ žiadne médium.";

"EMPTY_MEDIA_LIST" = "Vyprázdniť zoznam médií";
"EMPTY_MEDIA_LIST_DESCRIPTION" = "Zoznam médií je prázdny a preto nemožno spustiť prehrávanie";

"PLAYBACK_SCRUB_HELP" = "Posunom prsta nahor zmeníte rýchlosť posúvania.";
"PLAYBACK_SCRUB_HIGH" = "Posúvanie vysokou rýchlosťou";
"PLAYBACK_SCRUB_HALF" = "Posúvanie polovičnou rýchlosťou";
"PLAYBACK_SCRUB_QUARTER" = "Posúvanie štvrtinovou rýchlosťou";
"PLAYBACK_SCRUB_FINE" = "Jemné posúvanie";
"PLAYBACK_SCRUB_TOTAL_TIME_FORMAT" = "Uplynulo: %@, trvanie celkom: %@"; /* 1: elapsed time, 2: total time */
"PLAYBACK_SCRUB_REMAINING_TIME_FORMAT" = "Uplynulo: %@, %@"; /* 1: elapsed time, 2: remaining time */
"PLAYBACK_SCRUB_ACCESSIBILITY_TIME_DISPLAY" = "Zobrazenie času";
"PLAYBACK_POSITION" = "Pozícia pri prehrávaní";
"VIDEO_FILTER" = "Filtre videa";
"VIDEO_FILTER_RESET_BUTTON" = "Reset filtrov videa";
"VIDEO_ASPECT_RATIO_BUTTON" = "Pomer strán videa";
"BWD_BUTTON" = "Preskočiť dozadu";
"FWD_BUTTON" = "Preskočiť dopredu";
"PLAY_BUTTON" = "Prehrať";
"NEXT_BUTTON" = "Ďalej";
"PREV_BUTTON" = "Predchádzajúce";
"PLAY_ALL_BUTTON" = "Prehrať všetko";
"PLAY_ALL_HINT" = "Prehrať všetky médiá v kolekcii";

"RESET_VIDEO_FILTERS" = "Chcete vykonať reset filtrov pre video?";
"RESET_PLAYBACK_SPEED" = "Chcete vykonať reset rýchlosti prehrávania?";
"RESET_EQUALIZER" = "Chcete vykonať reset nastavení ekvalizéra?";
"RESET_SLEEP_TIMER" = "Chcete vykonať reset časovača uspania?";

"CUSTOM_EQUALIZER_PROFILES" = "Používateľské profily";
"DEFAULT_PROFILE_NAME" = "Používateľský profil";
"CUSTOM_EQUALIZER_ALERT_TITLE" = "Uložiť nový profil";
"CUSTOM_EQUALIZER_ALERT_MESSAGE" = "Chcete uložiť nový profil s vybranými hodnotami?";
"RENAME_CUSTOM_PROFILE_TITLE" = "Premenovať profil";
"DELETE_CUSTOM_PROFILE_TITLE" = "Vymazať profil";
"DELETE_CUSTOM_PROFILE_MESSAGE" = "Chcete vymazať vybraný profil?";

"VERSION_FORMAT" = "Verzia: %@";
"BASED_ON_FORMAT" = "Založené na:<br />%@";

"NEW" = "NOVINKA";

"VO_VIDEOPLAYER_TITLE" = "Prehrávač videa";
"VO_VIDEOPLAYER_DOUBLETAP" = "Zobrazenie alebo skrytie ovládacích prvkov prehrávania vykonáte dvojitým dotykom";

"FIRST_STEPS_ITUNES" = "Synchronizácia súboru";
"FIRST_STEPS_ITUNES_TITLE" = "Synchronizácia s vaším počítačom";
"FIRST_STEPS_ITUNES_DETAILS" = "Na použitie súčasti Finder alebo \"Zdieľania súboru\" pripojte svoj %@. Vyberte VLC pre prenos súborov.";
"FIRST_STEPS_WIFI_TITLE" = "Zdieľať cez Wi-Fi";
"FIRST_STEPS_WIFI_DETAILS" = "Zadajte vygenerovanú adresu URL vo vašom prehliadači, zatiaľ čo budete pripojení k rovnakej sieti ako váš %@.";
"FIRST_STEPS_CLOUDS" = "Služby typu Cloud";
"FIRST_STEPS_CLOUD_TITLE" = "Cloud";
"FIRST_STEPS_CLOUD_DETAILS" = "Odošlite vaše médium to cloudovej služby (ako Google Drive či Dropbox), na ich vzdialené stiahnutie alebo streamovanie.";

"PLEX_CHECK_ACCOUNT" = "Skontrolujte svoj účet Plex v nastaveniach";
"PLEX_ERROR_ACCOUNT" = "Chyba pri prihlasovaní k službe Plex";

"UNAUTHORIZED" = "Neautorizované";

"SERVER" = "Server";
"SERVER_PORT" = "Port";
"NO_SERVER_FOUND" = "Nenašiel sa žiadny server";
"NO_RECENT_STREAMS" = "Naposledy nebol prehrávaný žiadny stream";

"WEBINTF_TITLE" = "Zdieľanie cez Wi-Fi";
"WEBINTF_ETHERNET" = "Zdieľanie cez ethernet";
"WEBINTF_DROPFILES" = "Pustiť súbory";
"WEBINTF_DROPFILES_LONG" = "Ak chcete pridať súbory do vášho %@, preneste ich do tohto okna.<br>Alebo kliknite na tlačidlo \"+\" a použite dialógové okno na pridávanie súborov.";
"WEBINTF_DOWNLOADFILES" = "Stiahnuť súbory";
"WEBINTF_DOWNLOADFILES_LONG" = "Kliknite na súbor, ktorý chcete stiahnuť z %@.";
"WEBINTF_ADDRESS_COPIED" = "Adresa bola skopírovaná do schránky";
"WEBINTF_TITLE_ATV" = "Vzdialené prehrávanie";
"WEBINTF_DROPFILES_LONG_ATV" = "Presuňte súbory v okne na ich prehratie v %@.<br>Alebo kliknite na tlačidlo \"+\" na použitie dialógu pre výber súborov.";
"WEBINTF_URL_SENT" = "Adresa URL bola úspešne odoslaná.";
"WEBINTF_URL_EMPTY" = "Adresa URL nemôže byť prázdna.";
"WEBINTF_URL_INVALID" = "Neplatná adresa URL.";
"WEBINTF_AUTH_REQUIRED" = "Prosím zadajte prístupový kód nastavený vo VLC iOS:";
"WEBINTF_AUTH_WRONG_PASSCODE" = "Nesprávny prístupový kód.<br>Zostávajúce pokusy:";
"WEBINTF_AUTH_BANNED" = "Zadali ste príliš veľa nesprávnych prístupových kódov.<br>Prosím reštartujte VLC iOS a skúste to znovu.";

"DURATION" = "Trvanie";
"TITLE" = "Titul";
"ROTATE_BUTTON" = "Otočiť"; /* Accessibility label for rotate button on the player */
"ROTATE_BUTTON_HINT" = "Prepne režimy zobrazenia prehrávača na šírku a na výšku."; /* Accessibility hint for rotate button on the player */

"AUDIO_INFO_VC_TITLE" = "Informácia o zvuku";
"ENTER_URL" = "Pre prehrávanie zadajte adresu URL";
"HTTP_SERVER_ON" = "Zablokovať vzdialené prehrávanie";
"HTTP_SERVER_OFF" = "Zapnúť vzdialené prehrávanie";
"CACHED_MEDIA" = "Médium vo vyrovnávacej pamäti";
"CACHED_MEDIA_LONG" = "Médiá, ktoré sú tu zobrazené, sú uložené lokálne - na vašej Apple TV. Pamätajte na to, že obsah môže byť odstránený operačným systémom bez upovedomenia, vždy vtedy, keď nebeží VLC a zariadenie nemá dostatok pamäte.";
"DOWNLOAD_SUBS_FROM_OSO" = "Stiahnuť titulky...";
"FOUND_SUBS" = "Boli nájdené titulky";
"NO_SUB_FOUND_OSO" = "Pre mediálnu položku \"%@\" sa nenašli žiadne titulky.";
"SELECT_AUDIO_FROM_FILES" = "Načítať externý zvuk...";
"SELECT_SUBTITLE_FROM_FILES" = "Načítať externé titulky...";
"USE_SPDIF" = "Použiť prechod (S/PDIF)";

"PLAYBACK" = "Prehrávanie";
"REPEAT_MODE" = "Opakovať";
"REPEAT_DISABLED" = "Zablokované";
"REPEAT_SINGLE" = "Jednu položku";
"REPEAT_FOLDER" = "Priečinok";
"SHUFFLE" = "Náhodne";
"SHUFFLE_DISABLED" = "Vypnúť náhodné prehrávanie";

"RESET_NETWORK_STREAM_LIST_TITLE" = "Reset zoznamu";
"RESET_NETWORK_STREAM_LIST_TEXT" = "Natrvalo resetovať zoznam naposledy prehraných sieťových streamov.";

// MARK: - Local Network Service Names
"UPNP_LONG" = "Universal Plug'n'Play (UPnP)";
"UPNP_SHORT" = "UPnP";

"PLEX_LONG" = "Plex Media Server (cez Bonjour)";
"PLEX_SHORT" = "Plex";

"FTP_SHORT" = "FTP";
"SFTP_SHORT" = "SFTP";

"NFS_LONG" = "Network File System (NFS)";
"NFS_SHORT" = "NFS";

"BONJOUR_FILE_SERVERS" = "Súborový server BONJOUR";
"DSM_WORKGROUP" = "Pracovná skupina";

"URL_NOT_SUPPORTED" = "Adresu URL nemožno otvoriť";

// Insert %@ where play-pause-glyph should be placed
"DELETE_ITEM_HINT" = "Pre vymazanie stlačte %@"; /* Insert %@ where play-pause-glyph should be placed */
"DELETE_MESSAGE" = "Potvrďte vymazanie výberu";
"DELETE_MESSAGE_PLAYLIST" = "Naozaj chcete vymazať vybraný playlist?\nAsociované súbory s médiami sa nevymažú.";
"DELETE_MESSAGE_PLAYLIST_CONTENT" = "Naozaj chcete odstrániť vybrané médium z playlistu?\nTým nedôjde k vymazaniu z disku.";

// MARK: - Drag and Drop

"PROTOCOL_NOT_SELECTED" = "Nie je vybraný žiadny protokol";
"Settings" = "Nastavenia";

"ERROR" = "Chyba";
"SORT" = "Zoradiť";
"SORT_BY" = "Zoradiť podľa";
"SEARCH" = "Hľadanie";
"VIDEO" = "Video";

// MARK: - MediaViewController Swipable Header
"ALBUMS" = "Albumy";
"ARTISTS" = "Umelci";
"EPISODES" = "Epizódy";
"GENRES" = "Žánre";
"ALL_VIDEOS" = "Všetky videá";
"SONGS" = "Skladby";
"PLAYLISTS" = "Playlisty";
"VIDEO_GROUPS" = "Skupiny videí";
"HISTORY" = "História";
"MODIFIED_DATE" = "Upravený dátum";
"NAME" = "Meno";

// MARK: - EDIT

"BUTTON_MENU" = "Menu";
"BUTTON_MENU_HINT" = "Výber, zmena poradia a triedenie mediálnych položiek prítomných v tomto zobrazení";

"BUTTON_EDIT" = "Upraviť";
"BUTTON_EDIT_HINT" = "Režim úprav";

"BUTTON_SELECT" = "Vybrať";
"BUTTON_SELECT_HINT" = "Tlačidlo pre výber";

"BUTTON_SELECT_ALL" = "Vybrať všetko";
"BUTTON_SELECT_ALL_HINT" = "Vybrať všetky médiá v tomto zobrazení";

"BUTTON_HISTORY" = "História";
"BUTTON_HISTORY_HINT" = "Zobraziť naposledy prehrané médiá";

"BUTTON_CLEAR" = "Vyčistiť";
"CLEAR_HISTORY_TITLE" = "Vyčistiť históriu";
"CLEAR_HISTORY_MESSAGE" = "Potvrdiť vyčistenie histórie";

"ADD_TO_PLAYLIST" = "Pridať do playlistu";
"ADD_TO_PLAYLIST_HINT" = "Otvoriť menu na pridanie do playlistu";

"PLAY_AS_AUDIO" = "Prehrať ako zvuk";
"PLAY_AS_AUDIO_HINT" = "Prehrať video ako zvukový súbor.";

"PLAYLIST_PLACEHOLDER" = "Názov playlistu";
"PLAYLIST_DESCRIPTION" = "Vyberte si názov pre váš nový playlist";
"PLAYLIST_CREATION" = "Vytvoriť nový playlist";
"PLAYLIST_CREATION_HINT" = "Zobraziť interaktívnu ikonu na vytvorenie playlistu";
"ERROR_PLAYLIST_CREATION" = "Nepodarilo sa vytvoriť playlist";
"ERROR_PLAYLIST_TRACKS" = "Nepodarilo sa získať stopy";

"ERROR_RENAME_FAILED" = "Premenovanie bolo neúspešné";
"ERROR_EMPTY_NAME" = "Názov nemôže zostať prázdny";

"SHARE_LABEL" = "Zdieľať";
"SHARE_HINT" = "Zdieľať vybrané súbory";
"RENAME_HINT" = "Premenovať vybrané súbory";
"DELETE_HINT" = "Vymazať vybrané súbory";

"ADDITIONAL_OPTIONS" = "Dodatočné možnosti";

// MARK: - Sort

"BUTTON_SORT" = "Zoradiť";
"BUTTON_SORT_HINT" = "Zobraziť zoznam akcií zoradenia";
"HEADER_TITLE_SORT" = "Zoradiť podľa";
"DESCENDING_LABEL" = "Zostupné poradie";
"DESCENDING_SWITCH_LABEL" = "Vzostupné alebo zostupné poradie";
"DESCENDING_SWITCH_HINT" = "Zoradiť kontext vzostupne alebo zostupne";
"GRID_LAYOUT" = "Mriežka";
"GRID_LAYOUT_HINT" = "Zobrazovať položky vo forme mriežky";
"LIST_LAYOUT" = "Zoznam";
"HIDE_FEAT_ARTISTS" = "Skryť uvádzaných umelcov";
"HIDE_TRACK_NUMBERS" = "Skryť čísla stôp";

// MARK: - VLCMediaLibraryKit - Sorting Criteria

"ALPHA" = "Abecedne";
"DURATION" = "Trvanie";
"INSERTION_DATE" = "Dátum vloženia";
"LAST_MODIFICATION_DATE" = "Dátum poslednej úpravy";
"RELEASE_DATE" = "Dátum vydania";
"FILE_SIZE" = "Veľkosť súboru";
"ARTIST" = "Umelec";
"PLAY_COUNT" = "Počet prehratí";
"ALBUM" = "Album";
"FILENAME" = "Názov súboru";
"TRACK_NUMBER" = "Číslo stopy";
"NB_AUDIO" = "Číslo zvuku";
"NB_MEDIA" = "Číslo média";
"NB_VIDEO" = "Číslo videa";
"NB_ALBUM" = "Počet albumov";
"LAST_PLAYBACK_DATE" = "Dátum posledného prehrávania";
"TRACK_ID" = "ID stopy";
"CUSTOM" = "Používateľské";

// MARK: - VLCNetworkLoginTVViewController

"NO_SAVING_DATA" = "Nič sa nenašlo";

// MARK: - MediaCollectionViewCell

"UNKNOWN_ARTIST" = "Neznámy umelec";
"VARIOUS_ARTIST" = "Rôzni umelci";
"UNKNOWN_ALBUM" = "Neznámy album";
"SINGLE_ITEM_SELECTED" = "položka vybraná";
"MULTIPLE_ITEMS_SELECTED" = "položky vybrané";

// MARK: - VideoPlayerControls

"SUBTITLE_AND_TRACK_BUTTON" = "Titulky a zvukové stopy";
"SUBTITLE_AND_TRACK_HINT" = "Vyberte titulky alebo zvukové stopy";

"DVD_BUTTON" = "DVD";
"DVD_HINT" = "Rozhranie DVD";

"ROTATION_LOCK_BUTTON" = "Uzamknutie otočenia";
"ROTATION_LOCK_HINT" = "Uzamknúť aktuálnu orientáciu videa";

"REPEAT_HINT" = "Opakovať to isté médium";
"DO_NOT_REPEAT_HINT" = "Neopakovať zoznam médií";
"REPEAT_ALL_HINT" = "Opakovať zoznam médií";

"BACKWARD_BUTTON" = "Dozadu";
"BACKWARD_HINT" = "Preskočiť dozadu";

"PREVIOUS_BUTTON" = "Predchádzajúce";
"PREVIOUS_HINT" = "Predchádzajúce médium";

"PLAY_PAUSE_BUTTON" = "Prehrať alebo pozastaviť";
"PLAY_PAUSE_HINT" = "Prehrať alebo pozastaviť aktuálne prehrávanie";

"STOP_BUTTON" = "Stop";
"CLOSE_HINT" = "Zastaviť prehrávanie";

"MINIMIZE_BUTTON" = "Minimalizovať";
"MINIMIZE_HINT" = "Minimalizovať prehrávač";

"NEXT_HINT" = "Ďalšie médium";

"FORWARD_BUTTON" = "Dopredu";
"FORWARD_HINT" = "Preskočiť dopredu";

"INTERFACE_LOCK_BUTTON" = "Uzamknúť rozhranie";

"SELECT_A_MARK" = "Vybrať značku A";
"SELECT_A_MARK_HINT" = "Vybrať značku A zo slučky AB";
"SELECT_B_MARK" = "Vybrať značku B";
"SELECT_B_MARK_HINT" = "Vybrať značku B zo slučky AB";

"AB_LOOP" = "Slučka A→B";
"AB_LOOP_MARKS" = "Značky slučky A→B";

"RESET_AB_LOOP" = "Chcete odstrániť slučku A→B?";
"RESET_AB_LOOP_MARKS" = "Chcete resetovať značky slučky A→B?";

"SHUFFLE_HINT" = "Premiešať zoznam médií";
"SHUFFLE_OFF_HINT" = "Nepremiešavať zoznam médií";

"ASPECT_RATIO_TITLE" = "Pomery strán";
"VIDEO_ASPECT_RATIO_BUTTON" = "Pomer strán videa";
"VIDEO_ASPECT_RATIO_HINT" = "Zmeniť pomer strán aktuálneho videa";

"MORE_OPTIONS_BUTTON" = "Viac";
"MORE_OPTIONS_HINT" = "Zobraziť viac možností ovládania";

"PLAYBACK_CONTROLS_BAR_TITLE" = "Ovládacie prvky prehrávania";
"PLAYBACK_CONTROLS_BAR_HINT" = "Pozastaviť, vyhľadať, ďalšia kapitola";

"PLAYER_WARNING_SUBTITLE_CAST_TITLE" = "Titulky nie sú podporované";
"PLAYER_WARNING_SUBTITLE_CAST_DESCRIPTION" = "Titulky ešte nie sú podporované počas streamovania (castingu).";

// MARK: - MediaMoreOptionsActionSheet
"EQUALIZER_CELL_TITLE" = "Ekvalizér";
"MORE_OPTIONS_HEADER_TITLE" = "Možnosti videa";
"MORE_OPTIONS_HEADER_AUDIO_TITLE" = "Možnosti zvuku";
"BOOKMARKS_TITLE" = "Záložky";
"ADD_BOOKMARKS_TITLE" = "Pridať záložky";
"BOOKMARK_DEFAULT_NAME" = "Záložka pre";
"BOOKMARK_RENAME_TITLE" = "Premenovať záložku";
"BOOKMARK_DELETE_TITLE" = "Vymazať záložku";
"BOOKMARK_DELETE_MESSAGE" = "Potvrďte vymazanie záložky";
"INCREASE_BUTTON" = "Tlačidlo pre zvýšenie";
"INCREASE_PLAYBACK_SPEED" = "Zvýšiť rýchlosť prehrávania";
"INCREASE_AUDIO_DELAY" = "Zväčšiť oneskorenie zvuku";
"INCREASE_SUBTITLES_DELAY" = "Zväčšiť oneskorenie titulkov";
"DECREASE_BUTTON" = "Tlačidlo pre zníženie";
"DECREASE_PLAYBACK_SPEED" = "Znížiť rýchlosť prehrávania";
"DECREASE_AUDIO_DELAY" = "Zmenšiť oneskorenie zvuku";
"DECREASE_SUBTITLES_DELAY" = "Zmenšiť oneskorenie titulkov";
"DISPLAY_PLAYBACK_SPEED_SHORTCUT" = "Zobraziť skratku pre rýchlosť prehrávania";
"DISPLAY_PLAYBACK_SPEED_SHORTCUT_HINT" = "Zapnite na zobrazenie skratky pre rýchlosť prehrávania";
"VIDEO_FILTERS_HINT" = "Vyberte pre otvorenie zobrazenia filtrov videa";
"PLAYBACK_SPEED_HINT" = "Vyberte pre otvorenie zobrazenia rýchlosti prehrávania";
"SUBTITLES_DELAY_HINT" = "Vyberte pre otvorenie zobrazenia oneskorenia titulkov";
"AUDIO_DELAY_HINT" = "Vyberte pre otvorenie zobrazenia oneskorenia zvuku";
"SLEEP_TIMER_HINT" = "Vyberte pre otvorenie zobrazenia časovača uspania";
"EQUALIZER_HINT" = "Vyberte pre otvorenie zobrazenia ekvalizéra";
"CHAPTERS_HINT" = "Vyberte pre otvorenie zobrazenia kapitol";
"BOOKMARKS_HINT" = "Vyberte pre otvorenie zobrazenia záložiek";
"INTERFACE_LOCK_HINT" = "Aktivovať možnosť uzamknutia používateľského prostredia";

// MARK: - Settings
"FORCE_RESCAN_TITLE" = "Vynútiť si opätovné skenovanie knižnice médií";
"FORCE_RESCAN_MESSAGE" = "Chcete si vynútiť opätovné preskenovanie knižnice médií aplikáciou VLC? Zrejme to bude chvíľu trvať.";

"FEEDBACK_EMAIL_TITLE" = "Spätná väzba o VLC pre systém iOS a iPad";
"FEEDBACK_EMAIL_NOT_POSSIBLE_TITLE" = "E-mailové konto nie je nakonfigurované";
"FEEDBACK_EMAIL_NOT_POSSIBLE_LONG" = "Kontaktujte nás cez %@ z iného zariadenia.";

"SETTINGS_THEME_BLACK" = "Pri tmavom režime použiť čierne pozadie";
"SETTINGS_THEME_BLACK_SUBTITLE" = "Zlepší životnosť batérie na zariadeniach s OLED displejom";

"SETTINGS_RESET_TITLE" = "Reset nastavení";
"SETTINGS_RESET_MESSAGE" = "Chcete vykonať reset nastavení na predvolené hodnoty?";

"SETTINGS_PLAY_ALL" = "Plynulé prehrávanie pre kolekcie";
"SETTINGS_PLAY_ALL_HINT" = "Zapnúť pre automatické prehrávanie ďalšieho média na kartách so zvukom alebo videom";
"SETTINGS_PLAYLIST_PLAY_ALL" = "Plynulé prehrávanie pre playlisty";
"SETTINGS_PLAYLIST_PLAY_ALL_HINT" = "Zapnúť pre automatické prehrávanie ďalšieho média v playliste";

"SETTINGS_DOCUMENTATION" = "Dokumentácia";

// MARK: - Local Network

"SMBV1_WARN_TITLE" = "Výstraha pre pripojenie SMBv1";
"SMBV1_WARN_DESCRIPTION" = "Bol detegovaný starý protokol (SMBv1).\nNaozaj chcete pokračovať s SMBv1?\nOdporúčame vykonať aktualizáciu alebo zmenu nastavení servera.";
"SMBV1_CONTINUE" = "Pokračovať s SMBv1";
"SMBV1_NEXT_PROTOCOL" = "Vyskúšať SMBv2/v3";

// MARK: - Preview labels

"ENCODING" = "Kódovanie";

// MARK: - Media groups

"ADD_TO_MEDIA_GROUP" = "Pridať do skupiny médií";
"ADD_TO_MEDIA_GROUP_HINT" = "Otvoriť menu na pridanie do skupiny médií";

"MEDIA_GROUPS" = "skupiny médií";
"MEDIA_GROUPS_DESCRIPTION" = "Vyberte názov pre vašu novú skupinu médií";
"MEDIA_GROUPS_PLACEHOLDER" = "Názov skupiny médií";

"REMOVE_FROM_MEDIA_GROUP" = "Odstrániť zo skupiny médií";
"REMOVE_FROM_MEDIA_GROUP_HINT" = "Odstrániť vybrané zo skupiny médií";

"MEDIA_GROUP_CREATION" = "Nová skupina médií";
"MEDIA_GROUP_CREATION_HINT" = "Zobraziť upozornenie na vytvorenie playlistu";
"MEDIA_GROUP_MOVE_TO_ROOT" = "Presunúť obsah na najvyššiu úroveň";
"MEDIA_GROUP_MOVE_TO_ROOT_HINT" = "Presunúť obsah výberu na najvyššiu úroveň";

"BUTTON_REGROUP" = "Preskupiť";
"BUTTON_REGROUP_TITLE" = "Preskupiť výber";
"BUTTON_REGROUP_HINT" = "Pokus o preskupenie jedného média automaticky";
"BUTTON_REGROUP_DESCRIPTION" = "Naozaj sa chcete pokúsiť o automatické preskupenie jedného média?\nMôže to nejaký čas trvať.";

// MARK: - Files.app persistence file
"MEDIALIBRARY_FILES_PLACEHOLDER" = "Ak chcete pridať médium, umiestnite ho sem";
"MEDIALIBRARY_ADDING_PLACEHOLDER" = "Pridáva sa...";

// MARK: - QueueViewController

"PLAY_HINT" = "Prehrať";
"PLAY_LABEL" = "Prehrať";
"PLAY_NEXT_IN_QUEUE_HINT" = "Prehrať ďalšie vo fronte";
"PLAY_NEXT_IN_QUEUE_LABEL" = "Prehrať ďalšie vo fronte";
"APPEND_TO_QUEUE_HINT" = "Pripojiť do frontu";
"APPEND_TO_QUEUE_LABEL" = "Pripojiť do frontu";
"QUEUE_LABEL" = "Front";

"DISPLAY_AS" = "Zobraziť ako";

/* New strings */
"BRIGHTNESS_HINT" = "Vertikálne ovládanie jasu";
"BRIGHTNESS_SLIDER" = "Pre zmenu jasu posúvajte vertikálne";

/* New strings */
"VOLUME_HINT" = "Vertikálne ovládanie hlasitosti";
"VOLUME_SLIDER" = "Pre zmenu hlasitosti posúvajte vertikálne";

// MARK: - AudioMiniPlayer playback controls menu
"MENU_PLAYBACK_CONTROLS" = "Ovládacie prvky prehrávania";
"MENU_REPEAT_DISABLED" = "Neopakovať";
"MENU_REPEAT_SINGLE" = "Opakovať jedenkrát";
"MENU_REPEAT_ALL" = "Opakovať všetko";

// MARK: - ActionSheet

"ACTIONSHEET_BACKGROUND_LABEL" = "Pozadie listu pre akciu";
"ACTIONSHEET_BACKGROUND_HINT" = "List pre akciu odstránite dotykom.";

// MARK: - Donation
"DONATION_CUSTOM_AMOUNT" = "Zadajte používateľom určenú sumu";
"DONATION_TITLE" = "Súkromie má prednosť pred ziskom";
"DONATION_DESCRIPTION" = "Súkromné multimédium, s otvoreným zdrojom, podporované vami. Žiadne reklamy, žiadne sledovanie, žiadny kompromis. Voľne dostupné na použitie pre každého. Prispejte teraz na podporu VideoLAN.";
"DONATION_WINDOW_TITLE" = "Príspevok pre VideoLAN";
"DONATE_CC_DC" = "Kreditná alebo debetná karta";
"DONATION_CHOOSE_PP" = "Prosím vyberte svojho poskytovateľa platby";
"DONATION_CHOOSE_CURRENCY" = "Prosím zvoľte menu";
"DONATION_AMOUNT" = "Suma príspevku: %@";
"DONATION_CC_NUM" = "Číslo kreditnej karty";
"DONATION_CC_EXPIRY_DATE" = "Dátum vypršania platnosti";
"DONATION_CC_EXPIRY_DATE_MONTH" = "MM";
"DONATION_CC_EXPIRY_DATE_YEAR" = "RR";
"DONATION_CC_CVV" = "CVV";
"DONATION_APPLE_PAY_NOT_POSSIBLE" = "Zlyhanie konfigurácie Apple Pay";
"DONATION_APPLE_PAY_NOT_POSSIBLE_LONG" = "Programu VLC sa nepodarilo nakonfigurovať Apple Pay na realizáciu prispenia. Prosím pokračujte výberom iného poskytovateľa platby.";
"DONATION_DONATE_BUTTON" = "Podporiť";
"PURCHASE_FAILED" = "Objednanie bolo neúspešné.";
"SEND_DONATION" = "Pošlite svoj príspevok";
"PURCHASE_SUCESS_TITLE" = "Príspevok bol odoslaný";
"PURCHASE_SUCESS_DESCRIPTION" = "Ďakujeme Vám za Váš príspevok!";
"DONATION_CONTINUE" = "Pokračovať";
"BUTTON_NOT_NOW" = "Teraz nie";
"DONATION_NAGSCREEN_TITLE" = "Prispejte dnes";
"DONATION_NAGSCREEN_SUBTITLE" = "Podporte multimédium dostupné voľne a s otvoreným zdrojovým kódom";
"DONATION_INVOICES" = "Faktúry";
"DONATION_RECEIPTS" = "Potvrdenia";
"DONATION_INVOICES_RECEIPTS" = "Faktúry a potvrdenia";
"DONATION_CHARGES_CLEARED_ON_REINSTALL" = "Ak ste VLC preinštalovali, faktúry alebo potvrdenia pochádzajúce z predchádzajúcich príspevkov nebudú dostupné, keďže sa všetky osobné údaje ukladajú iba na zariadení.\n\nAk máte nejaké otázky, kontaktujte nás prostredníctvom adresy donation@videolan.org a uveďte toto ID anonymného používateľa: %@";
"DONATION_CANCEL_MONTHLY" = "Zrušiť pravidelný príspevok";
"DONATION_MONTHLY" = "Mesačne";
"DONATION_MONTHLY_FORMAT" = "%@/mesiac";
"DONATION_MONTHLY_VIDEOLAN" = "Mesačný príspevok pre VideoLAN";
"DONATION_ONCE" = "Jedenkrát";
"DONATION_UPDATE_MONTHLY" = "Aktualizovať pravidelný príspevok";
"DONATION_VIDEOLAN" = "Príspevok pre VideoLAN";
"DONATION_CANCEL_LONG" = "Mrzí sa, že rušíte pravidelné mesačné prispievanie pre VideoLAN. Vaša predchádzajúca podpora pre nás veľa znamená. Veľmi pekne Vám ďakujeme!";
"DONATION_BANK_TRANSFER" = "Bankový prevod";
"DONATION_BANK_TRANSFER_LONG" = "Príspevky poskytnuté pre VideoLAN spracováva Stripe. VideoLAN neukladá ani nezhromažďuje vaše osobné údaje.";
"DONATION_BUTTON_AGREE" = "Súhlasím";
"DONATION_IBAN" = "Číslo bankového účtu (IBAN)";
"DONATION_EMAIL" = "E-mail";
"DONATION_NAME" = "Názov";
"DONATION_NAME_BANK_ACCOUNT" = "Pomenovanie na bankovom účte";
"DONATION_EMBARGOED_COUNTRY" = "Momentálne nemôžeme prijímať príspevky vo Vašej krajine. Užívajte si VLC!";

// MARK: - Playback keyboard shortcuts

"KEY_JUMP_BACKWARDS" = "Preskočiť dozadu";
"KEY_JUMP_FORWARDS" = "Preskočiť dopredu";
"KEY_INCREASE_PLAYBACK_SPEED" = "Zvýšiť rýchlosť prehrávania";
"KEY_DECREASE_PLAYBACK_SPEED" = "Znížiť rýchlosť prehrávania";
"KEY_RESET_PLAYBACK_SPEED" = "Reset rýchlosti prehrávania";
"KEY_SEEK_TO_PERCENT" = "Vyhľadávať na %i%% trvania";

// MARK: - TitleSelection

"TITLESELECTION_BACKGROUND_LABEL" = "Pozadie pre výber titulu";
"TITLESELECTION_BACKGROUND_HINT" = "Zobrazenie odstránite dotykom.";

// MARK: - NEW DELETE STRINGS
"DELETE_SINGLE_TITLE" = "Vymazať \"%@\"?";
"DELETE_MULTIPLE_TITLE" = "Vymazať \"%@\" a %d iné?";

// MARK: - AppIntent Strings
"APPINTENT_PLAY_MEDIA_TITLE" = "Prehrať v pozadí";
"APPINTENT_PLAY_MEDIA_DESCRIPTION" = "Prehrať vybraný playlist v pozadí, bez otvorenia aplikácie.";
"APPINTENT_PLAY_MEDIA_PLAY_${mediaName}" = "Prehrať ${mediaName} v pozadí";

// MARK: - VerticalSliderControl Strings
"VERTICAL_SLIDER_CONTROL_ACCESSIBILITY_LABEL" = "Vertikálny posuvník";
"VERTICAL_SLIDER_CONTROL_INCREMENT_ACTION" = "Prírastok";
"VERTICAL_SLIDER_CONTROL_DECREMENT_ACTION" = "Úbytok";

// MARK: - Download Completion Announcement
"DOWNLOAD_COMPLETED_ANNOUNCEMENT" = "Sťahovanie súboru \"%@\" bolo dokončené";

//MARK: - Playlist Add Action Status
"ADD_TO_PLAYLIST_STATUS_MESSAGE" = "%d médium pridané do %@";
"ADD_ALERT_TITLE" = "Našiel sa výber v playliste";
"ADD_ALERT_MESSAGE_SINGLE" = "Pokúšate sa pridať médium, ktoré už je súčasťou %@";
"ADD_ALERT_MESSAGE_MULTIPLE" = "Pokúšate sa pridať médiá %d, ktoré už sú súčasťou %@";

//MARK: - Last played playlist indicator
"LAST_PLAYED_PLAYLIST_LABEL_TITLE" = "Naposledy prehrané";
